;; Parkour
[DarkEvent_ABB_Parkour X2DarkEventTemplate]
; LWOTC Needs Translation
DisplayName="Permanent: Parkour"
; End Translation
SummaryText="The enemy deploys some units that have been trained to climb walls."
QuoteText="\"Wait, I blocked the ladder! What the hell?!\""
QuoteTextAuthor="- Anonymous Grenadier who is now terrified of heights"
PreMissionText="Grants some aliens and some ADVENT troops the Parkour perk."
PostMissionSuccessText="Dark Event Countered: Tactical Upgrades (Parkour)"
PostMissionFailureText="Failed to Counter Dark Event: Tactical Upgrades (Parkour)"

[DarkEventAbility_ABB_Parkour X2AbilityTemplate]
LocFriendlyName="Dark Event: Tactical Upgrades (Parkour)"
LocLongDescription="Some enemy units gain the ability to climb walls."

;; Zone of Control (LWOTC)
[DarkEvent_ZoneOfControl_LW X2DarkEventTemplate]
; LWOTC Needs Translation
DisplayName="Permanent: Zone of Control"
; End Translation
SummaryText="The enemy deploys some Faceless and other melee-focused aliens that have been trained to obstruct our soldiers' mobility and aim at close range."
QuoteText="\"We might not be able to kite those things as easily anymore.\""
QuoteTextAuthor="- Anonymous Rebel wishing for something more durable to wear than a t-shirt"
PreMissionText="Grants some Faceless and other aliens the Zone of Control perk."
PostMissionSuccessText="Dark Event Countered: Tactical Upgrades (Zone of Control)"
PostMissionFailureText="Failed to Counter Dark Event: Tactical Upgrades (Zone of Control)"

[DarkEventAbility_ZoneOfControl_LW X2AbilityTemplate]
LocFriendlyName="Dark Event: Tactical Upgrades (Zone of Control)"
LocLongDescription="Some enemy units gain the ability to debuff our soldiers' mobility and aim when within close proximity to them."

;; Pugilistic
[DarkEvent_Pugilistic X2DarkEventTemplate]
; LWOTC Needs Translation
DisplayName="Permanent: Pugilistic"
; End Translation
SummaryText="The enemy deploys some aliens and ADVENT troops that have vastly increased accuracy with melee attacks."
QuoteText="\"Finally, some WORTHY adversaries!\""
QuoteTextAuthor="- Anonymous Shinobi with giant ego and severe lacerations en route to the infirmary"
PreMissionText="Grants some enemies the Pugilistic perk."
PostMissionSuccessText="Dark Event Countered: Tactical Upgrades (Pugilistic)"
PostMissionFailureText="Failed to Counter Dark Event: Tactical Upgrades (Pugilistic)"

[DarkEventAbility_Pugilistic X2AbilityTemplate]
LocFriendlyName="Dark Event: Tactical Upgrades (Pugilistic)"
LocLongDescription="Some enemy units gain vastly increased accuracy with melee attacks."

;; Anatomy
[DarkEvent_Anatomy X2DarkEventTemplate]
; LWOTC Needs Translation
DisplayName="Permanent: Anatomy"
; End Translation
SummaryText="The enemy deploys some units that have received special training or programming on the weaknesses of our armor and our mechanized units, granting them extra critical hit chance and armor piercing."
QuoteText="\"I see ADVENT is wasting no time conducting their own autopsies and breakdowns. Let's try not to give them more...materials.\""
QuoteTextAuthor="- Dr. Richard Tygan"
PreMissionText="Grants some enemies the Anatomy perk."
PostMissionSuccessText="Dark Event Countered: Tactical Upgrades (Anatomy)"
PostMissionFailureText="Failed to Counter Dark Event: Tactical Upgrades (Anatomy)"

[DarkEventAbility_Anatomy X2AbilityTemplate]
LocFriendlyName="Dark Event: Tactical Upgrades (Anatomy)"
LocLongDescription="Some enemy units gain additional critical hit chance and armor piercing."

;; Fortress
[DarkEvent_Fortress X2DarkEventTemplate]
; LWOTC Needs Translation
DisplayName="Permanent: Fortress"
; End Translation
SummaryText="The enemy deploys some Psionic units that have developed the power to nullify any explosives, poison, fire, acid, or frost directed at them.""
QuoteText="\"Their Psionics only grow in ability. Ours must as well.\""
QuoteTextAuthor="- Geist"
PreMissionText="Grants some Psionic enemies the Fortress perk."
PostMissionSuccessText="Dark Event Countered: Tactical Upgrades (Fortress)"
PostMissionFailureText="Failed to Counter Dark Event: Tactical Upgrades (Fortress)"

[DarkEventAbility_Fortress X2AbilityTemplate]
LocFriendlyName="Dark Event: Tactical Upgrades (Fortress)"
LocLongDescription="Some enemy Psionic units gain immunity to explosives, poison, fire, acid, and frost."

;; HEAT Ammo
[DarkEvent_ShadowOps_HEATAmmo X2DarkEventTemplate]
; LWOTC Needs Translation
DisplayName="Permanent: HEAT Ammo"
; End Translation
SummaryText="The enemy equips some of their forces with HEAT Ammo, granting them a large damage boost against mechanical targets."
QuoteText="\"Since we can field our own robots, I'm not surprised ADVENT came up with some kind of counter.\""
QuoteTextAuthor="- Chief Engineer Lily Shen"
PreMissionText="Grants some enemies the HEAT Ammo perk."
PostMissionSuccessText="Dark Event Countered: Tactical Upgrades (HEAT Ammo)"
PostMissionFailureText="Failed to Counter Dark Event: Tactical Upgrades (HEAT Ammo)"

[DarkEventAbility_ShadowOps_HEATAmmo X2AbilityTemplate]
LocFriendlyName="Dark Event: Tactical Upgrades (HEAT Ammo)"
LocLongDescription="Some enemy units gain a large damage boost against mechanical targets."

;; Butcher
[DarkEvent_ShadowOps_Butcher X2DarkEventTemplate]
; LWOTC Needs Translation
DisplayName="Permanent: Butcher"
; End Translation
SummaryText="The enemy deploys some of the most seasoned killers among their ranks. These units deal bonus damage against organic targets."
QuoteText="\"Some of those things seem like they have a taste for blood. I can relate.\""
QuoteTextAuthor="- Konstantin 'Volk' Volikov"
PreMissionText="Grants some enemies the Butcher perk."
PostMissionSuccessText="Dark Event Countered: Tactical Upgrades (Butcher)"
PostMissionFailureText="Failed to Counter Dark Event: Tactical Upgrades (Butcher)"

[DarkEventAbility_ShadowOps_Butcher X2AbilityTemplate]
LocFriendlyName="Dark Event: Tactical Upgrades (Butcher)"
LocLongDescription="Some enemy units gain a moderate damage boost against organic targets."

;; Predator
[DarkEvent_F_Predator X2DarkEventTemplate]
; LWOTC Needs Translation
DisplayName="Permanent: Predator"
; End Translation
SummaryText="The enemy deploys some units that have had a lot of practice shooting at exposed targets during haven raids. These units gain bonus aim and critical chance against flanked targets."
QuoteText="\"Remember -- stay in cover.\""
QuoteTextAuthor="- John 'Central' Bradford"
PreMissionText="Grants some enemies the Predator perk."
PostMissionSuccessText="Dark Event Countered: Tactical Upgrades (Predator)"
PostMissionFailureText="Failed to Counter Dark Event: Tactical Upgrades (Predator)"

[DarkEventAbility_F_Predator X2AbilityTemplate]
LocFriendlyName="Dark Event: Tactical Upgrades (Predator)"
LocLongDescription="Some enemy units gain bonus aim and critical chance against flanked targets."

;; Terrifying Suppression
[DarkEvent_MZPanicSuppression X2DarkEventTemplate]
; LWOTC Needs Translation
DisplayName="Permanent: Terrifying Suppression"
; End Translation
SummaryText="The enemy deploys units who are terrifyingly adept at suppressing fire. Our soldiers may panic when being suppressed by them."
QuoteText="\"Our bodies, or our spirits. Whichever breaks first, it matters not to the Elders.\""
QuoteTextAuthor="- Betos"
PreMissionText="Grants some enemies the Terrifying Suppression perk."
PostMissionSuccessText="Dark Event Countered: Tactical Upgrades (Terrifying Suppression)"
PostMissionFailureText="Failed to Counter Dark Event: Tactical Upgrades (Terrifying Suppression)"

[DarkEventAbility_MZPanicSuppression X2AbilityTemplate]
LocFriendlyName="Dark Event: Tactical Upgrades (Terrifying Suppression)"
LocLongDescription="Some enemy units' suppression abilities can cause their targets to panic."

;; Apex Predator
[DarkEvent_ApexPredator_LW X2DarkEventTemplate]
; LWOTC Needs Translation
DisplayName="Permanent: Apex Predator"
; End Translation
SummaryText="The enemy trains all of their Sidewinders, Mutons and ADVENT Shock Troopers on how to deliver the most frightening critical strikes. When these units score a critical hit, their target and the target's nearby squadmates may panic."
QuoteText="\"If you can't handle a little gore, pack up and go home. If your home is even still there.\""
QuoteTextAuthor="- Konstantin 'Volk' Volikov"
PreMissionText="Grants all enemy Sidewinders, Mutons and ADVENT Shock Troopers the Apex Predator perk."
PostMissionSuccessText="Dark Event Countered: Tactical Upgrades (Apex Predator)"
PostMissionFailureText="Failed to Counter Dark Event: Tactical Upgrades (Apex Predator)"

[DarkEventAbility_ApexPredator_LW X2AbilityTemplate]
LocFriendlyName="Dark Event: Tactical Upgrades (Apex Predator)"
LocLongDescription="All enemy Sidewinders, Mutons and ADVENT Shock Troopers may cause their targets and the target's nearby allies to panic when scoring a critical hit."

;; Sniper Elite
[DarkEvent_F_SniperElite X2DarkEventTemplate]
; LWOTC Needs Translation
DisplayName="Permanent: Sniper Elite"
; End Translation
SummaryText="The enemy upgrades the targeting capabilities of all of their Turrets, and trains their Najas and other snipers in advanced marksmanship. These units suffer no aim penalties from using Squadsight."
QuoteText="\"A good sniper is cold, and interested most in murder and pursuing their prey.\""
QuoteTextAuthor="- Anonymous Sharpshooter who hates being touched"
PreMissionText="Grants all enemy Turrets, Najas and other snipers the Sniper Elite perk."
PostMissionSuccessText="Dark Event Countered: Tactical Upgrades (Sniper Elite)"
PostMissionFailureText="Failed to Counter Dark Event: Tactical Upgrades (Sniper Elite)"

[DarkEventAbility_F_SniperElite X2AbilityTemplate]
LocFriendlyName="Dark Event: Tactical Upgrades (Sniper Elite)"
LocLongDescription="All enemy Turrets, Najas and other snipers don't suffer aim penalties from using Squadsight."

;; Thrash (Andromedon)
[DarkEvent_ThrashA X2DarkEventTemplate]
; LWOTC Needs Translation
DisplayName="Permanent: Thrash (Andromedon)"
; End Translation
SummaryText="The enemy upgrades their Andromedon suits with a new feature allowing them to make free fist attacks if a hostile target moves or attacks within melee range of them, but only when it isn't their own turn."
QuoteText="\"Their punches are still clumsy compared to mine. I say bring it on.\""
QuoteTextAuthor="- Anonymous MEC Trooper with a fondness for the Kinetic Strike Module"
PreMissionText="Grants all enemy Andromedons and Andromedon Shells the Thrash perk."
PostMissionSuccessText="Dark Event Countered: Tactical Upgrades (Thrash (Andromedon))"
PostMissionFailureText="Failed to Counter Dark Event: Tactical Upgrades (Thrash (Andromedon))"

[DarkEventAbility_ThrashA X2AbilityTemplate]
LocFriendlyName="Dark Event: Tactical Upgrades (Thrash (Andromedon))"
LocLongDescription="All enemy Andromedons, their variants, and Andromedon Shells gain the ability to make free fist attacks if a hostile target moves or attacks within melee range of them, but only when it isn't their own turn."

;; Thrash (Berserker)
[DarkEvent_ThrashB X2DarkEventTemplate]
; LWOTC Needs Translation
DisplayName="Permanent: Thrash (Berserker)"
; End Translation
SummaryText="The enemy pumps their Berserkers and related variants up with even more stimulants, allowing them to make free fist attacks if a hostile target moves or attacks within melee range of them, but only when it isn't their own turn. Targets hit may be impaired."
QuoteText="\"I was almost certain the Berserker could not possibly get any more aggressive. Even our most seasoned close combat veterans would do well to stay back, Commander.\""
QuoteTextAuthor="- Dr. Richard Tygan"
PreMissionText="Grants all enemy Berserker variants the Thrash perk."
PostMissionSuccessText="Dark Event Countered: Tactical Upgrades (Thrash (Berserker))"
PostMissionFailureText="Failed to Counter Dark Event: Tactical Upgrades (Thrash (Berserker))"

[DarkEventAbility_ThrashB X2AbilityTemplate]
LocFriendlyName="Dark Event: Tactical Upgrades (Thrash (Berserker))"
LocLongDescription="All enemy Berserker variants gain the ability to make free fist attacks if a hostile target moves or attacks within melee range of them, but only when it isn't their own turn. Targets hit may be impaired."

;; Thrash (Faceless)
[DarkEvent_ThrashF X2DarkEventTemplate]
; LWOTC Needs Translation
DisplayName="Permanent: Thrash (Faceless)"
; End Translation
SummaryText="The enemy gives their Faceless variants additional CQC training, allowing them to make free claw attacks if a hostile target moves or attacks within 3 tiles of them, but only when it isn't their own turn. This attack can only hit the unit that triggers it and can't deal effects other than damage."
QuoteText="\"So, those Faceless spies in our havens...any chance we can just let them walk away?\""
QuoteTextAuthor="- Anonymous rebel quaking in his boots"
PreMissionText="Grants all enemy Faceless variants the Thrash perk."
PostMissionSuccessText="Dark Event Countered: Tactical Upgrades (Thrash (Faceless))"
PostMissionFailureText="Failed to Counter Dark Event: Tactical Upgrades (Thrash (Faceless))"

[DarkEventAbility_ThrashF X2AbilityTemplate]
LocFriendlyName="Dark Event: Tactical Upgrades (Thrash (Faceless))"
LocLongDescription="All enemy Faceless variants gain the ability to make free claw attacks if a hostile target moves or attacks within 3 tiles of them, but only when it isn't their own turn. This attack can only hit the unit that triggers it and can't deal effects other than damage."

;; Heavy Hitter
[DarkEvent_ShadowOps_Mayhem_LW2 X2DarkEventTemplate]
; LWOTC Needs Translation
DisplayName="Permanent: Heavy Hitter"
; End Translation
SummaryText="The enemy upgrades some of their units across the board, including but not limited to: firearms, explosives, melee attacks, and Psionic power. This allows affected units to deal +2 damage with any source."
QuoteText="\"Commander, we're running out of time. We have to end this war!\""
QuoteTextAuthor="- John 'Central' Bradford"
PreMissionText="Grants some enemies the Heavy Hitter perk."
PostMissionSuccessText="Dark Event Countered: Tactical Upgrades (Heavy Hitter)"
PostMissionFailureText="Failed to Counter Dark Event: Tactical Upgrades (Heavy Hitter)"

[DarkEventAbility_ShadowOps_Mayhem_LW2 X2AbilityTemplate]
LocFriendlyName="Dark Event: Tactical Upgrades (Heavy Hitter)"
LocLongDescription="Some enemy units gain a +2 boost to all damage they deal."

;; Omen
[DarkEvent_PAOmen X2DarkEventTemplate]
; LWOTC Needs Translation
DisplayName="Permanent: Omen"
; End Translation
SummaryText="The enemy trains all of their Archons to be able to follow up their Blazing Pinions with another action, even if they use it with a dash move."
QuoteText="\"This new training planned for the Archons isn't that dissimilar from our own prefered methods.\""
QuoteTextAuthor="- Betos"
PreMissionText="Grants all Archons the Omen perk."
PostMissionSuccessText="Dark Event Countered: Tactical Upgrades (Omen)"
PostMissionFailureText="Failed to Counter Dark Event: Tactical Upgrades (Omen)"

[DarkEventAbility_PAOmen X2AbilityTemplate]
LocFriendlyName="Dark Event: Tactical Upgrades (Omen)"
LocLongDescription="All enemy Archons can now use Blazing Pinions without ending their turn, even with a dash move."

;; Puppet Show
[DarkEvent_PAPuppetShow X2DarkEventTemplate]
; LWOTC Needs Translation
DisplayName="Permanent: Puppet Show"
; End Translation
SummaryText="The enemy trains all of their Sectoids and Sectoid Commanders to be able to use their Psionic abilities without ending the turn. Additionally, enemy Sectoids can now use their Psi Reanimation and Mindspin skills once per turn, and enemy Sectoid Commanders have the cooldown of their Mass Mindspin and Mass Reanimation abilities reduced by one."
QuoteText="\"I fear no man. But that...thing...it scares me.\""
QuoteTextAuthor="- Anonymous Heavy who has mind control related PTSD"
PreMissionText="Grants all enemy Sectoids and Sectoid Commanders the Puppet Show perk."
PostMissionSuccessText="Dark Event Countered: Tactical Upgrades (Puppet Show)"
PostMissionFailureText="Failed to Counter Dark Event: Tactical Upgrades (Puppet Show)"

[DarkEventAbility_PAPuppetShow X2AbilityTemplate]
LocFriendlyName="Dark Event: Tactical Upgrades (Puppet Show)"
LocLongDescription="All enemy Sectoids can now use Psi Reanimation and Mindspin without ending their turn, and both skills can be used once per turn. All enemy Sectoid Commanders can now use Mass Reanimation and Mass Mindspin without ending their turn, and the cooldown of those two abilities is reduced by one."

;; Hazardous Cascade
[DarkEvent_PADangerZone X2DarkEventTemplate]
; LWOTC Needs Translation
DisplayName="Permanent: Hazardous Cascade"
; End Translation
SummaryText="The enemy upgrades the payloads carried by Andromedons and Mutons. All Andromedons gain +2 radius to their Acid Blob ability and can use it without ending their turn. All Muton variants gain +2 to their grenade radius."
QuoteText="\"I can't imagine what it's like to be one of you people who isn't immune to those things.\""
QuoteTextAuthor="- Anonymous Psion who regularly gets punched by other soldiers for being smug"
PreMissionText="Grants all Andromedons and Mutons the Hazardous Cascade perk."
PostMissionSuccessText="Dark Event Countered: Tactical Upgrades (Hazardous Cascade)"
PostMissionFailureText="Failed to Counter Dark Event: Tactical Upgrades (Hazardous Cascade)"

[DarkEventAbility_PADangerZone X2AbilityTemplate]
LocFriendlyName="Dark Event: Tactical Upgrades (Hazardous Cascade)"
LocLongDescription="All Andromedons gain +2 radius to their Acid Blob ability and can use it without ending their turn. All Muton variants gain +2 to their grenade radius."

;; Cold Blooded
[DarkEvent_F_ColdBlooded X2DarkEventTemplate]
; LWOTC Needs Translation
DisplayName="Permanent: Cold Blooded"
; End Translation
SummaryText="The enemy trains some of their units to make quick follow-up attacks at targets that are poisoned, bleeding, or burning from fire or acid, making their first standard shot against such a target a free action."
QuoteText="\"Looks like I'm going to be pretty busy making Hazmat Vests.\""
QuoteTextAuthor="- Chief Engineer Lily Shen"
PreMissionText="Grants some enemy units the Cold Blooded perk."
PostMissionSuccessText="Dark Event Countered: Tactical Upgrades (Cold Blooded)"
PostMissionFailureText="Failed to Counter Dark Event: Tactical Upgrades (Cold Blooded)"

[DarkEventAbility_F_ColdBlooded X2AbilityTemplate]
LocFriendlyName="Dark Event: Tactical Upgrades (Cold Blooded)"
LocLongDescription="Some enemy units gain the ability for their first shot against a target who is poisoned, bleeding, or burning from fire or acid to be a free action once per turn."

;; Salt In The Wound
[DarkEvent_F_SaltInTheWound X2DarkEventTemplate]
; LWOTC Needs Translation
DisplayName="Permanent: Salt In The Wound"
; End Translation
SummaryText="The enemy trains some of their units to exploit the pain of targets that are poisoned, bleeding, or burning from fire or acid, making them do +1 damage to those units, including with their dealt damage over time effects."
QuoteText="\"How could a living being do something so cruel to another living being, you ask? In my case, I suppose it's because I enjoy it!\""
QuoteTextAuthor="- Anonymous Arsonist who tortures small animals and isn't allowed near our prisoners"
PreMissionText="Grants some enemy units the Salt In The Wound perk."
PostMissionSuccessText="Dark Event Countered: Tactical Upgrades (Salt In The Wound)"
PostMissionFailureText="Failed to Counter Dark Event: Tactical Upgrades (Salt In The Wound)"

[DarkEventAbility_F_SaltInTheWound X2AbilityTemplate]
LocFriendlyName="Dark Event: Tactical Upgrades (Salt In The Wound)"
LocLongDescription="Some enemy units gain the ability to deal +1 damage to targets that are poisoned, bleeding, or burning from fire or acid, including with their dealt damage over time effects."

;; Entwine
[DarkEvent_XV_Entwine X2DarkEventTemplate]
; LWOTC Needs Translation
DisplayName="Permanent: Entwine"
; End Translation
SummaryText="The enemy enhances the muscles in their Vipers and related species, as well as training them to better use their bound targets as shields. This allows them to deal +2 more damage per turn to a bound target, gain +40 defense while binding, and have +10 aim for the Tongue Grab ability."
QuoteText="\"I'd still let one grab me. To take one for the team! I don't have a Viper fetish!\""
QuoteTextAuthor="- Anonymous Assault who definitely has a Viper fetish"
PreMissionText="Grants all enemy Vipers and related species the Entwine perk."
PostMissionSuccessText="Dark Event Countered: Tactical Upgrades (Entwine)"
PostMissionFailureText="Failed to Counter Dark Event: Tactical Upgrades (Entwine)"

[DarkEventAbility_XV_Entwine X2AbilityTemplate]
LocFriendlyName="Dark Event: Tactical Upgrades (Entwine)"
LocLongDescription="All enemy Vipers and related species, while binding a target, gain +40 defense and do 2 more damage per turn. Additionally, their Tongue Grab ability gains +10 aim."

;; Serpentine
[DarkEvent_Serpentine X2DarkEventTemplate]
; LWOTC Needs Translation
DisplayName="Permanent: Serpentine"
; End Translation
SummaryText="The enemy modifies the poison glands of Vipers, Sidewinders and Najas to make the act of spitting poison easier on them, changing their Poison Spit ability to be a free action."
QuoteText="\"I never thought I could hate those things more than I already do.\""
QuoteTextAuthor="- John 'Central' Bradford"
PreMissionText="Grants all enemy Vipers, Sidewinders and Najas the Serpentine perk."
PostMissionSuccessText="Dark Event Countered: Tactical Upgrades (Serpentine)"
PostMissionFailureText="Failed to Counter Dark Event: Tactical Upgrades (Serpentine)"

[DarkEventAbility_Serpentine X2AbilityTemplate]
LocFriendlyName="Dark Event: Tactical Upgrades (Serpentine)"
LocLongDescription="The Poison Spit ability becomes a free action for all enemy Vipers, Sidewinders and Najas."

;; Survival Instinct (LWOTC)
[DarkEvent_SurvivalInstinct_LW X2DarkEventTemplate]
; LWOTC Needs Translation
DisplayName="Permanent: Survival Instinct"
; End Translation
SummaryText="The enemy trains some of their ADVENT troops in survival skills, giving them extra defense and crit chance when at less than full health."
QuoteText="\"To think the false gods actually care how many of their own soldiers they lose.\""
QuoteTextAuthor="- Geist"
PreMissionText="Grants some enemy ADVENT troops the Survival Instinct perk."
PostMissionSuccessText="Dark Event Countered: Tactical Upgrades (Survival Instinct)"
PostMissionFailureText="Failed to Counter Dark Event: Tactical Upgrades (Survival Instinct)"

[DarkEventAbility_SurvivalInstinct_LW X2AbilityTemplate]
LocFriendlyName="Dark Event: Tactical Upgrades (Survival Instinct)"
LocLongDescription="Some ADVENT troops will gain extra defense and crit chance when at less than full health."

;; Unstoppable
[DarkEvent_Unstoppable_LW X2DarkEventTemplate]
; LWOTC Needs Translation
DisplayName="Permanent: Unstoppable"
; End Translation
SummaryText="The enemy trains many of their dedicated melee units to resist Mobility reduction."
QuoteText="\"Another example of the Elders' Chosen spreading their knowledge and power to their subordinates.\""
QuoteTextAuthor="- Betos"
PreMissionText="Grants Berserkers, Chryssalids, Faceless, and many of their variants the Unstoppable perk."
PostMissionSuccessText="Dark Event Countered: Tactical Upgrades (Unstoppable)"
PostMissionFailureText="Failed to Counter Dark Event: Tactical Upgrades (Unstoppable)"

[DarkEventAbility_Unstoppable_LW X2AbilityTemplate]
LocFriendlyName="Dark Event: Tactical Upgrades (Unstoppable)"
LocLongDescription="Berserkers, Chryssalids, Faceless, and many variants of them cannot have their Mobility lowered below 7."

;; Resilience (Shadow Ops)
[DarkEvent_ShadowOps_Resilience X2DarkEventTemplate]
; LWOTC Needs Translation
DisplayName="Permanent: Resilience"
; End Translation
SummaryText="The enemy upgrades some of their units' defensive capabilities, rendering them immune to critical hits from any source."
QuoteText="\"This kind of durability isn't something we can just engineer a solution for.\""
QuoteTextAuthor="- Chief Engineer Lily Shen"
PreMissionText="Grants some enemies the Resilience perk."
PostMissionSuccessText="Dark Event Countered: Tactical Upgrades (Resilience)"
PostMissionFailureText="Failed to Counter Dark Event: Tactical Upgrades (Resilience)"

[DarkEventAbility_ShadowOps_Resilience X2AbilityTemplate]
LocFriendlyName="Dark Event: Tactical Upgrades (Resilience)"
LocLongDescription="Some enemy units gain complete immunity to critical hits."

;; Bungee Slime
[DarkEvent_PABungeeSlime X2DarkEventTemplate]
; LWOTC Needs Translation
DisplayName="Permanent: Bungee Slime"
; End Translation
SummaryText="The enemy tampers with the DNA of their Faceless variants, making them even more malleable. This extends the range of Scything Claws and similar abilities by 2 tiles each to length and width. Does not affect Thrash."
QuoteText="\"Bungee Slime possesses the properties of both rubber and slime.\""
QuoteTextAuthor="- Some geek in the science lab"
PreMissionText="Grants Faceless variants the Bungee Slime perk."
PostMissionSuccessText="Dark Event Countered: Tactical Upgrades (Bungee Slime)"
PostMissionFailureText="Failed to Counter Dark Event: Tactical Upgrades (Bungee Slime)"

[DarkEventAbility_PABungeeSlime X2AbilityTemplate]
LocFriendlyName="Dark Event: Tactical Upgrades (Bungee Slime)"
LocLongDescription="Enemy Faceless variants gain +2 length and +2 width to the range of Scything Claws and similar abilities. Does not affect Thrash."